In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
disco_viejo = pd.read_csv('old_HDD.csv', encoding='latin1')
df = disco_viejo.copy()
df.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [3]:
df.columns = [c.lower() for c in df.columns] #con esto ponemos todo en minusculas son buenas practicas

In [4]:
df.columns = df.columns.str.strip() # Ahora eliminamos espacios en blanco al principio y al final de los nombres de las columnas

In [5]:
df.duplicated().sum()  #Duplicados del DataFrame

0

In [6]:
duplicates = df[df['title'].duplicated(keep=False)]

In [7]:
duplicates.head(20).ascending=False

In [8]:
duplicates = duplicates.sort_values(by='title')
duplicates

    first_name last_name             title  release_year  category_id
0     PENELOPE   GUINESS  ACADEMY DINOSAUR          2006            6
212  CHRISTIAN     GABLE  ACADEMY DINOSAUR          2006            6
489    LUCILLE     TRACY  ACADEMY DINOSAUR          2006            6
780     SANDRA      PECK  ACADEMY DINOSAUR          2006            6
19        NICK  WAHLBERG  ADAPTATION HOLES          2006            6
..         ...       ...               ...           ...          ...
750      WOODY   HOFFMAN     WYOMING STORM          2006           13
719      JULIA   MCQUEEN    YOUNG LANGUAGE          2006            6
65          ED     CHASE    YOUNG LANGUAGE          2006            6
967        VAL    BOLGER        YOUTH KICK          2006           12
608     SANDRA    KILMER        YOUTH KICK          2006           12

[653 rows x 5 columns]

In [9]:
duplicates[duplicates.duplicated(subset=["first_name", "last_name", "title" ], keep=False)] #veo si hay duplicados que cumplan las 3 columnas

Empty DataFrame
Columns: [first_name, last_name, title, release_year, category_id]
Index: []

In [10]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [11]:
df.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [12]:
df['category_id'].unique() #VALORES UNICOS

array([ 6,  2, 13, 10, 14,  4, 11, 15,  8,  3,  9,  5, 12,  1, 16,  7],
      dtype=int64)

In [13]:
df['title'].nunique()

614

In [14]:
df.to_csv('../src/film_actor.csv', index=False) # guardamos en la carpeta src el archivo limpio y le llamamos FILM_ACTOR

In [16]:
from sqlalchemy import create_engine
import pymysql

In [17]:
str_conn = f'mysql+pymysql://root:a1b2e3l4_IRONHACK@localhost:3306/movies'
cursor = create_engine(str_conn)

In [18]:
df.to_sql(name='film_actor',
            con=cursor,
            if_exists='replace',
            index=False)

1000